In [1]:
import pandas as pd

In [6]:
import pandas as pd

titanic_df = pd.read_csv("Titanic_data.csv")
print(titanic_df.shape)

(891, 12)

In [7]:
titanic_df.Age.quantile(q=0.75)

np.float64(38.0)

In [8]:
#sum(), prod(), cumsum(), var(), std(), mean(), quantile()

In [9]:
titanic_df.isna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [10]:
titanic_df.isna().sum(axis=0)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [11]:
titanic_df.isna().sum(axis=1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [13]:
# GroupBy

group_by_gender = titanic_df[["Sex", "Fare", "Age", "Survived"]].groupby(by = "Sex")

In [14]:
group_by_gender

In [15]:
group_by_gender.mean()

             Fare        Age  Survived
Sex
female  44.479818  27.915709  0.742038
male    25.523893  30.726645  0.188908

In [18]:
group_by_gender.value_counts(["Survived"])

Sex     Survived
female  1           233
        0            81
male    0           468
        1           109
Name: count, dtype: int64

In [19]:
group_by_gender.sum()

              Fare       Age  Survived
Sex
female  13966.6628   7286.00       233
male    14727.2865  13919.17       109

In [21]:
group_by_two = titanic_df.groupby(by = ["Embarked", "Survived"])

In [22]:
group_by_two.mean(numeric_only=True)

                   PassengerId    Pclass        Age     SibSp     Parch  \
Embarked Survived
C        0          409.853333  2.200000  33.666667  0.253333  0.253333
         1          473.989247  1.634409  28.973671  0.494624  0.451613
Q        0          480.404255  2.936170  30.325000  0.510638  0.276596
         1          319.966667  2.866667  22.500000  0.300000  0.000000
S        0          449.868852  2.545667  30.203966  0.611241  0.348946
         1          448.857143  1.967742  28.113184  0.493088  0.539171

                        Fare
Embarked Survived
C        0         35.443335
         1         79.720926
Q        0         13.335904
         1         13.182227
S        0         20.743987
         1         39.547081

In [28]:
titanic_df.groupby("Sex").head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

# Correlation and Covariance

In [31]:
titanic_df["Age"].cov(titanic_df["Fare"])

np.float64(73.84902981461923)

In [32]:
titanic_df[["Age", "Fare"]].cov()

             Age         Fare
Age   211.019125    73.849030
Fare   73.849030  2469.436846

In [34]:
titanic_df[["Age", "Fare"]].corr()

           Age      Fare
Age   1.000000  0.096067
Fare  0.096067  1.000000

In [35]:
titanic_df[["Age", "Fare", "Pclass", "Survived"]].corr()

               Age      Fare    Pclass  Survived
Age       1.000000  0.096067 -0.369226 -0.077221
Fare      0.096067  1.000000 -0.549500  0.257307
Pclass   -0.369226 -0.549500  1.000000 -0.338481
Survived -0.077221  0.257307 -0.338481  1.000000

In [36]:
titanic_df[["Age", "Fare"]].dropna().corr()

           Age      Fare
Age   1.000000  0.096067
Fare  0.096067  1.000000

In [47]:
sampled = titanic_df.sample(n=300, random_state = 999)

In [48]:
sampled[["Age", "Fare"]].corr()

          Age     Fare
Age   1.00000  0.03441
Fare  0.03441  1.00000

In [49]:
for data in titanic_df.name:
    print(data.split(",")[-1].split(".")[0])

AttributeError: 'DataFrame' object has no attribute 'name'

In [50]:
initials = [ data.split(",")[-1].split(".")[0] for data in titanic_df.name]

AttributeError: 'DataFrame' object has no attribute 'name'

In [51]:
titanic_df["Initials"]

KeyError: 'Initials'